firefox.xhtml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-20 Wed 16:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>List of things broken in Firefox</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="static/style.css" /><meta property="og:title" content="Soham's Website" /><meta property="og:url" content="https://sohamg.xyz" /><meta property="og:image" content="https://sohamg.xyz/img.png" /> <meta property="og:type" content="website" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">List of things broken in Firefox</h1>

<div id="outline-container-orgc3e69a4" class="outline-2">
<h2 id="orgc3e69a4">Works in Chrome, not in Firefox</h2>
<div class="outline-text-2" id="text-orgc3e69a4">
<p>
Relevant extensions: Ublock origin
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Item</th>
<th scope="col" class="org-left">Datetime</th>
<th scope="col" class="org-left">Notes</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Amtrak Wifi</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-11 Fri&gt;</span></span></td>
<td class="org-left">Captive Portal is grabage,</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">extremely unreliable with firefox</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">usable with chrome</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">PNC Bank</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-19 Sat&gt;</span></span></td>
<td class="org-left">Straight up doesn't work.</td>
</tr>

<tr>
<td class="org-left">Online Banking</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Google Drive/Docs</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-27 Sun&gt;</span></span></td>
<td class="org-left">Cannot create new Google Docs neither</td>
</tr>

<tr>
<td class="org-left">Enterprise</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">from Drive UI nor docs.google.com</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Jewel Osco Website</td>
<td class="org-left"><span class="timestamp-wrapper"><span class="timestamp">&lt;2023-08-20 Sun&gt;</span></span></td>
<td class="org-left">Search function is broken.</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">(which is quite critical)</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><hr />Made with Emacs <br /> CC-BY-SA </footer>
</div>
</body>
</html>
